Revit 2027 API
Truss.Curves Property
Get all the truss curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray Curves { get; }
Public ReadOnly Property Curves As CurveArray
	Get
public:
property CurveArray^ Curves {
	CurveArray^ get ();
}
member Curves : CurveArray with get
Return Value
CurveArray
The Curves property returns a CurveArray that contains all the truss curves.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace